In [1]:
import pandas as pd
from env import get_connection
import os

import numpy as np
import matplotlib.pyplot as plt

# import splitting and imputing functions
from sklearn.model_selection import train_test_split
from sklearn.impute import SimpleImputer

# turn off pink boxes for demo
import warnings
warnings.filterwarnings("ignore")

# import our own acquire module
import acquire
#import my own prepare module
import prepare

In [2]:
url = get_connection('iris_db')

In [3]:
query = '''
SELECT * FROM measurements
JOIN species USING (species_id)
'''

In [4]:
df = pd.read_sql(query, url)

In [5]:
df

,species_id,measurement_id,sepal_length,sepal_width,petal_length,petal_width,species_name
0,1,1,5.1,3.5,1.4,0.2,setosa
1,1,2,4.9,3.0,1.4,0.2,setosa
2,1,3,4.7,3.2,1.3,0.2,setosa
3,1,4,4.6,3.1,1.5,0.2,setosa
4,1,5,5.0,3.6,1.4,0.2,setosa
...,...,...,...,...,...,...,...
145,3,146,6.7,3.0,5.2,2.3,virginica
146,3,147,6.3,2.5,5.0,1.9,virginica
147,3,148,6.5,3.0,5.2,2.0,virginica
148,3,149,6.2,3.4,5.4,2.3,virginica
149,3,150,5.9,3.0,5.1,1.8,virginica

In [6]:
df.shape

(150, 7)

In [7]:
df.columns

Index(['species_id', 'measurement_id', 'sepal_length', 'sepal_width',
       'petal_length', 'petal_width', 'species_name'],
      dtype='object')

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   species_id      150 non-null    int64
 1   measurement_id  150 non-null    int64
 2   sepal_length    150 non-null    float64
 3   sepal_width     150 non-null    float64
 4   petal_length    150 non-null    float64
 5   petal_width     150 non-null    float64
 6   species_name    150 non-null    object
dtypes: float64(4), int64(2), object(1)
memory usage: 8.3+ KB

In [9]:
df.describe()

,species_id,measurement_id,sepal_length,sepal_width,petal_length,petal_width
count,150.000000,150.000000,150.000000,150.000000,150.000000,150.000000
mean,2.000000,75.500000,5.843333,3.057333,3.758000,1.199333
std,0.819232,43.445368,0.828066,0.435866,1.765298,0.762238
min,1.000000,1.000000,4.300000,2.000000,1.000000,0.100000
25%,1.000000,38.250000,5.100000,2.800000,1.600000,0.300000
50%,2.000000,75.500000,5.800000,3.000000,4.350000,1.300000
75%,3.000000,112.750000,6.400000,3.300000,5.100000,1.800000
max,3.000000,150.000000,7.900000,4.400000,6.900000,2.500000

In [10]:
df_google = pd.read_sql('SELECT * FROM passengers', get_connection('titanic_db'))

In [11]:
df_google.head(3)

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,None,Southampton,0
1,1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0
2,2,1,3,female,26.0,0,0,7.9250,S,Third,None,Southampton,1

In [12]:
df_google.shape

(891, 13)

In [13]:
df_google.columns

Index(['passenger_id', 'survived', 'pclass', 'sex', 'age', 'sibsp', 'parch',
       'fare', 'embarked', 'class', 'deck', 'embark_town', 'alone'],
      dtype='object')

In [14]:
df_google.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 13 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   passenger_id  891 non-null    int64
 1   survived      891 non-null    int64
 2   pclass        891 non-null    int64
 3   sex           891 non-null    object
 4   age           714 non-null    float64
 5   sibsp         891 non-null    int64
 6   parch         891 non-null    int64
 7   fare          891 non-null    float64
 8   embarked      889 non-null    object
 9   class         891 non-null    object
 10  deck          203 non-null    object
 11  embark_town   889 non-null    object
 12  alone         891 non-null    int64
dtypes: float64(2), int64(6), object(5)
memory usage: 90.6+ KB

In [15]:
df_google.describe()

,passenger_id,survived,pclass,age,sibsp,parch,fare,alone
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000,891.000000
mean,445.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208,0.602694
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429,0.489615
min,0.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000,0.000000
25%,222.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400,0.000000
50%,445.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200,1.000000
75%,667.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000,1.000000
max,890.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200,1.000000

In [16]:
df_google.nunique()

passenger_id    891
survived          2
pclass            3
sex               2
age              88
sibsp             7
parch             7
fare            248
embarked          3
class             3
deck              7
embark_town       3
alone             2
dtype: int64

In [17]:
df_excel = pd.read_excel('titanic.xlsx')

In [18]:
df_excel_sample = df_excel.head(100)

In [19]:
df_excel_sample

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
95,96,0,3,"Shorney, Mr. Charles Joseph",male,NaN,0,0,374910,8.0500,NaN,S
96,97,0,1,"Goldschmidt, Mr. George B",male,71.0,0,0,PC 17754,34.6542,A5,C
97,98,1,1,"Greenfield, Mr. William Bertram",male,23.0,0,1,PC 17759,63.3583,D10 D12,C
98,99,1,2,"Doling, Mrs. John T (Ada Julia Bone)",female,34.0,0,1,231919,23.0000,NaN,S
99,100,0,2,"Kantor, Mr. Sinai",male,34.0,1,0,244367,26.0000,NaN,S

In [20]:
df_excel.shape

(891, 12)

In [21]:
df_excel.columns[0:5]

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex'], dtype='object')

In [22]:
df_excel.select_dtypes(['object']).columns

Index(['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked'], dtype='object')

In [23]:
df_excel.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [24]:
df_excel.select_dtypes(['int64', 'float64']).columns

Index(['PassengerId', 'Survived', 'Pclass', 'Age', 'SibSp', 'Parch', 'Fare'], dtype='object')

In [25]:
df_excel.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [26]:
df_excel[['PassengerId', 'Survived', 'Pclass', 'Age', 'SibSp', 'Parch', 'Fare']].max()

PassengerId    891.0000
Survived         1.0000
Pclass           3.0000
Age             80.0000
SibSp            8.0000
Parch            6.0000
Fare           512.3292
dtype: float64

In [27]:
df_excel[['PassengerId', 'Survived', 'Pclass', 'Age', 'SibSp', 'Parch', 'Fare']].min()

PassengerId    1.00
Survived       0.00
Pclass         1.00
Age            0.42
SibSp          0.00
Parch          0.00
Fare           0.00
dtype: float64

In [28]:
(
    df_excel[['PassengerId', 'Survived', 'Pclass', 'Age', 'SibSp', 'Parch', 'Fare']].max() - 
    df_excel[['PassengerId', 'Survived', 'Pclass', 'Age', 'SibSp', 'Parch', 'Fare']].min()
)

PassengerId    890.0000
Survived         1.0000
Pclass           2.0000
Age             79.5800
SibSp            8.0000
Parch            6.0000
Fare           512.3292
dtype: float64

In [29]:
import acquire

In [30]:
df = acquire.get_titanic_data()

In [31]:
df.deck.replace('NaN', 'None Assigned')

0      NaN
1        C
2      NaN
3        C
4      NaN
      ...
886    NaN
887      B
888    NaN
889      C
890    NaN
Name: deck, Length: 891, dtype: object

In [32]:
df_iris = acquire.get_iris_data()

In [33]:
df_iris

,Unnamed: 0,species_id,measurement_id,sepal_length,sepal_width,petal_length,petal_width,species_name
0,0,1,1,5.1,3.5,1.4,0.2,setosa
1,1,1,2,4.9,3.0,1.4,0.2,setosa
2,2,1,3,4.7,3.2,1.3,0.2,setosa
3,3,1,4,4.6,3.1,1.5,0.2,setosa
4,4,1,5,5.0,3.6,1.4,0.2,setosa
...,...,...,...,...,...,...,...,...
145,145,3,146,6.7,3.0,5.2,2.3,virginica
146,146,3,147,6.3,2.5,5.0,1.9,virginica
147,147,3,148,6.5,3.0,5.2,2.0,virginica
148,148,3,149,6.2,3.4,5.4,2.3,virginica
149,149,3,150,5.9,3.0,5.1,1.8,virginica

In [34]:
dropped_columns_df = df_iris.drop(['Unnamed: 0', 'species_id', 'measurement_id'], axis=1)

In [35]:
dropped_columns_df

     sepal_length  sepal_width  petal_length  petal_width species_name
0             5.1          3.5           1.4          0.2       setosa
1             4.9          3.0           1.4          0.2       setosa
2             4.7          3.2           1.3          0.2       setosa
3             4.6          3.1           1.5          0.2       setosa
4             5.0          3.6           1.4          0.2       setosa
..            ...          ...           ...          ...          ...
145           6.7          3.0           5.2          2.3    virginica
146           6.3          2.5           5.0          1.9    virginica
147           6.5          3.0           5.2          2.0    virginica
148           6.2          3.4           5.4          2.3    virginica
149           5.9          3.0           5.1          1.8    virginica

[150 rows x 5 columns]

In [36]:
dropped_columns_df.rename(columns = {'species_name':'species'}, inplace = True)

In [37]:
dropped_columns_df

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [38]:
dummies = pd.get_dummies(dropped_columns_df[['species']])

In [39]:
dropped_columns_df = pd.concat([dropped_columns_df, dummies], axis = 1)
dropped_columns_df

,sepal_length,sepal_width,petal_length,petal_width,species,species_setosa,species_versicolor,species_virginica
0,5.1,3.5,1.4,0.2,setosa,1,0,0
1,4.9,3.0,1.4,0.2,setosa,1,0,0
2,4.7,3.2,1.3,0.2,setosa,1,0,0
3,4.6,3.1,1.5,0.2,setosa,1,0,0
4,5.0,3.6,1.4,0.2,setosa,1,0,0
...,...,...,...,...,...,...,...,...
145,6.7,3.0,5.2,2.3,virginica,0,0,1
146,6.3,2.5,5.0,1.9,virginica,0,0,1
147,6.5,3.0,5.2,2.0,virginica,0,0,1
148,6.2,3.4,5.4,2.3,virginica,0,0,1
149,5.9,3.0,5.1,1.8,virginica,0,0,1

In [75]:
def prep_iris(df):
    
    to_drop = ['Unnamed: 0', 'species_id', 'measurement_id']
    
    df.drop(columns = to_drop, inplace = True)
    
    df.rename(columns = {'species_name':'species'}, inplace = True)
    
    dummies = pd.get_dummies(df[['species']])
    
    df = pd.concat([df, dummies], axis = 1)
    
    return df

In [46]:
test_df = acquire.get_iris_data()
test_df

,Unnamed: 0,species_id,measurement_id,sepal_length,sepal_width,petal_length,petal_width,species_name
0,0,1,1,5.1,3.5,1.4,0.2,setosa
1,1,1,2,4.9,3.0,1.4,0.2,setosa
2,2,1,3,4.7,3.2,1.3,0.2,setosa
3,3,1,4,4.6,3.1,1.5,0.2,setosa
4,4,1,5,5.0,3.6,1.4,0.2,setosa
...,...,...,...,...,...,...,...,...
145,145,3,146,6.7,3.0,5.2,2.3,virginica
146,146,3,147,6.3,2.5,5.0,1.9,virginica
147,147,3,148,6.5,3.0,5.2,2.0,virginica
148,148,3,149,6.2,3.4,5.4,2.3,virginica
149,149,3,150,5.9,3.0,5.1,1.8,virginica

In [48]:
new_iris_df = prep_iris(test_df)

In [49]:
new_iris_df

,sepal_length,sepal_width,petal_length,petal_width,species,species_setosa,species_versicolor,species_virginica
0,5.1,3.5,1.4,0.2,setosa,1,0,0
1,4.9,3.0,1.4,0.2,setosa,1,0,0
2,4.7,3.2,1.3,0.2,setosa,1,0,0
3,4.6,3.1,1.5,0.2,setosa,1,0,0
4,5.0,3.6,1.4,0.2,setosa,1,0,0
...,...,...,...,...,...,...,...,...
145,6.7,3.0,5.2,2.3,virginica,0,0,1
146,6.3,2.5,5.0,1.9,virginica,0,0,1
147,6.5,3.0,5.2,2.0,virginica,0,0,1
148,6.2,3.4,5.4,2.3,virginica,0,0,1
149,5.9,3.0,5.1,1.8,virginica,0,0,1

In [50]:
titanic_new = acquire.get_titanic_data()

In [51]:
titanic_new

,Unnamed: 0,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
0,0,0,0,3,male,22.0,1,0,7.2500,S,Third,NaN,Southampton,0
1,1,1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0
2,2,2,1,3,female,26.0,0,0,7.9250,S,Third,NaN,Southampton,1
3,3,3,1,1,female,35.0,1,0,53.1000,S,First,C,Southampton,0
4,4,4,0,3,male,35.0,0,0,8.0500,S,Third,NaN,Southampton,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,886,886,0,2,male,27.0,0,0,13.0000,S,Second,NaN,Southampton,1
887,887,887,1,1,female,19.0,0,0,30.0000,S,First,B,Southampton,1
888,888,888,0,3,female,NaN,1,2,23.4500,S,Third,NaN,Southampton,0
889,889,889,1,1,male,26.0,0,0,30.0000,C,First,C,Cherbourg,1
890,890,890,0,3,male,32.0,0,0,7.7500,Q,Third,NaN,Queenstown,1

In [52]:
drop_cols = ['Unnamed: 0', 'passenger_id', 'embarked', 'class', 'deck']
titanic_new.drop(columns = drop_cols, inplace = True)

In [53]:
titanic_new

     survived  pclass     sex   age  sibsp  parch     fare  embark_town  alone
0           0       3    male  22.0      1      0   7.2500  Southampton      0
1           1       1  female  38.0      1      0  71.2833    Cherbourg      0
2           1       3  female  26.0      0      0   7.9250  Southampton      1
3           1       1  female  35.0      1      0  53.1000  Southampton      0
4           0       3    male  35.0      0      0   8.0500  Southampton      1
..        ...     ...     ...   ...    ...    ...      ...          ...    ...
886         0       2    male  27.0      0      0  13.0000  Southampton      1
887         1       1  female  19.0      0      0  30.0000  Southampton      1
888         0       3  female   NaN      1      2  23.4500  Southampton      0
889         1       1    male  26.0      0      0  30.0000    Cherbourg      1
890         0       3    male  32.0      0      0   7.7500   Queenstown      1

[891 rows x 9 columns]

In [54]:
dummies = pd.get_dummies(titanic_new[['sex', 'embark_town', 'pclass']])

titanic_new = pd.concat([titanic_new, dummies], axis = 1)

In [55]:
titanic_new

,survived,pclass,sex,age,sibsp,parch,fare,embark_town,alone,pclass,sex_female,sex_male,embark_town_Cherbourg,embark_town_Queenstown,embark_town_Southampton
0,0,3,male,22.0,1,0,7.2500,Southampton,0,3,0,1,0,0,1
1,1,1,female,38.0,1,0,71.2833,Cherbourg,0,1,1,0,1,0,0
2,1,3,female,26.0,0,0,7.9250,Southampton,1,3,1,0,0,0,1
3,1,1,female,35.0,1,0,53.1000,Southampton,0,1,1,0,0,0,1
4,0,3,male,35.0,0,0,8.0500,Southampton,1,3,0,1,0,0,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,Southampton,1,2,0,1,0,0,1
887,1,1,female,19.0,0,0,30.0000,Southampton,1,1,1,0,0,0,1
888,0,3,female,NaN,1,2,23.4500,Southampton,0,3,1,0,0,0,1
889,1,1,male,26.0,0,0,30.0000,Cherbourg,1,1,0,1,1,0,0
890,0,3,male,32.0,0,0,7.7500,Queenstown,1,3,0,1,0,1,0

In [56]:
def prep_titanic(df):
    
    drop_cols = ['Unnamed: 0', 'passenger_id', 'embarked', 'class', 'deck']
    
    df.drop(columns = drop_cols, inplace = True)
    
    dummies = pd.get_dummies(df[['sex', 'embark_town', 'pclass']])

    df = pd.concat([df, dummies], axis = 1)
    
    return df

In [57]:
test_titanic = acquire.get_titanic_data()

In [58]:
test_titanic

,Unnamed: 0,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
0,0,0,0,3,male,22.0,1,0,7.2500,S,Third,NaN,Southampton,0
1,1,1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0
2,2,2,1,3,female,26.0,0,0,7.9250,S,Third,NaN,Southampton,1
3,3,3,1,1,female,35.0,1,0,53.1000,S,First,C,Southampton,0
4,4,4,0,3,male,35.0,0,0,8.0500,S,Third,NaN,Southampton,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,886,886,0,2,male,27.0,0,0,13.0000,S,Second,NaN,Southampton,1
887,887,887,1,1,female,19.0,0,0,30.0000,S,First,B,Southampton,1
888,888,888,0,3,female,NaN,1,2,23.4500,S,Third,NaN,Southampton,0
889,889,889,1,1,male,26.0,0,0,30.0000,C,First,C,Cherbourg,1
890,890,890,0,3,male,32.0,0,0,7.7500,Q,Third,NaN,Queenstown,1

In [59]:
cleaned_titanic = prep_titanic(test_titanic)

In [60]:
cleaned_titanic

,survived,pclass,sex,age,sibsp,parch,fare,embark_town,alone,pclass,sex_female,sex_male,embark_town_Cherbourg,embark_town_Queenstown,embark_town_Southampton
0,0,3,male,22.0,1,0,7.2500,Southampton,0,3,0,1,0,0,1
1,1,1,female,38.0,1,0,71.2833,Cherbourg,0,1,1,0,1,0,0
2,1,3,female,26.0,0,0,7.9250,Southampton,1,3,1,0,0,0,1
3,1,1,female,35.0,1,0,53.1000,Southampton,0,1,1,0,0,0,1
4,0,3,male,35.0,0,0,8.0500,Southampton,1,3,0,1,0,0,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,Southampton,1,2,0,1,0,0,1
887,1,1,female,19.0,0,0,30.0000,Southampton,1,1,1,0,0,0,1
888,0,3,female,NaN,1,2,23.4500,Southampton,0,3,1,0,0,0,1
889,1,1,male,26.0,0,0,30.0000,Cherbourg,1,1,0,1,1,0,0
890,0,3,male,32.0,0,0,7.7500,Queenstown,1,3,0,1,0,1,0

In [61]:
telco_df = acquire.get_telco_data()

In [62]:
telco_df

,Unnamed: 0,payment_type_id,contract_type_id,internet_service_type_id,customer_id,gender,senior_citizen,partner,dependents,tenure,...,tech_support,streaming_tv,streaming_movies,paperless_billing,monthly_charges,total_charges,churn,internet_service_type,contract_type,payment_type
0,0,2,2,1,0002-ORFBO,Female,0,Yes,Yes,9,...,Yes,Yes,No,Yes,65.60,593.3,No,DSL,One year,Mailed check
1,1,2,1,1,0003-MKNFE,Male,0,No,No,9,...,No,No,Yes,No,59.90,542.4,No,DSL,Month-to-month,Mailed check
2,2,1,1,2,0004-TLHLJ,Male,0,No,No,4,...,No,No,No,Yes,73.90,280.85,Yes,Fiber optic,Month-to-month,Electronic check
3,3,1,1,2,0011-IGKFF,Male,1,Yes,No,13,...,No,Yes,Yes,Yes,98.00,1237.85,Yes,Fiber optic,Month-to-month,Electronic check
4,4,2,1,2,0013-EXCHZ,Female,1,Yes,No,3,...,Yes,Yes,No,Yes,83.90,267.4,Yes,Fiber optic,Month-to-month,Mailed check
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
7038,7038,2,2,1,9987-LUTYD,Female,0,No,No,13,...,Yes,No,No,No,55.15,742.9,No,DSL,One year,Mailed check
7039,7039,1,1,2,9992-RRAMN,Male,0,Yes,No,22,...,No,No,Yes,Yes,85.10,1873.7,Yes,Fiber optic,Month-to-month,Electronic check
7040,7040,2,1,1,9992-UJOEL,Male,0,No,No,2,...,No,No,No,Yes,50.30,92.75,No,DSL,Month-to-month,Mailed check
7041,7041,2,3,1,9993-LHIEB,Male,0,Yes,Yes,67,...,Yes,No,Yes,No,67.85,4627.65,No,DSL,Two year,Mailed check
7042,7042,1,3,1,9995-HOTOH,Male,0,Yes,Yes,63,...,No,Yes,Yes,No,59.00,3707.6,No,DSL,Two year,Electronic check

In [63]:
useless_cols = ['Unnamed: 0', 'customer_id', 'internet_service_type', 'streaming_tv', 'streaming_movies',
                'contract_type', 'payment_type', 'paperless_billing', 'device_protection']
telco_df.drop(columns = useless_cols, inplace = True)

In [64]:
telco_df

,payment_type_id,contract_type_id,internet_service_type_id,gender,senior_citizen,partner,dependents,tenure,phone_service,multiple_lines,online_security,online_backup,tech_support,monthly_charges,total_charges,churn
0,2,2,1,Female,0,Yes,Yes,9,Yes,No,No,Yes,Yes,65.60,593.3,No
1,2,1,1,Male,0,No,No,9,Yes,Yes,No,No,No,59.90,542.4,No
2,1,1,2,Male,0,No,No,4,Yes,No,No,No,No,73.90,280.85,Yes
3,1,1,2,Male,1,Yes,No,13,Yes,No,No,Yes,No,98.00,1237.85,Yes
4,2,1,2,Female,1,Yes,No,3,Yes,No,No,No,Yes,83.90,267.4,Yes
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
7038,2,2,1,Female,0,No,No,13,Yes,No,Yes,No,Yes,55.15,742.9,No
7039,1,1,2,Male,0,Yes,No,22,Yes,Yes,No,No,No,85.10,1873.7,Yes
7040,2,1,1,Male,0,No,No,2,Yes,No,No,Yes,No,50.30,92.75,No
7041,2,3,1,Male,0,Yes,Yes,67,Yes,No,Yes,No,Yes,67.85,4627.65,No
7042,1,3,1,Male,0,Yes,Yes,63,No,No phone service,Yes,Yes,No,59.00,3707.6,No

In [65]:
dummies = pd.get_dummies(telco_df[['gender', 'partner', 'dependents', 'phone_service', 'multiple_lines', 'churn',
                                  'online_security', 'online_backup', 'tech_support']])

telco_df = pd.concat([telco_df, dummies], axis = 1)

In [66]:
telco_df

,payment_type_id,contract_type_id,internet_service_type_id,gender,senior_citizen,partner,dependents,tenure,phone_service,multiple_lines,...,churn_Yes,online_security_No,online_security_No internet service,online_security_Yes,online_backup_No,online_backup_No internet service,online_backup_Yes,tech_support_No,tech_support_No internet service,tech_support_Yes
0,2,2,1,Female,0,Yes,Yes,9,Yes,No,...,0,1,0,0,0,0,1,0,0,1
1,2,1,1,Male,0,No,No,9,Yes,Yes,...,0,1,0,0,1,0,0,1,0,0
2,1,1,2,Male,0,No,No,4,Yes,No,...,1,1,0,0,1,0,0,1,0,0
3,1,1,2,Male,1,Yes,No,13,Yes,No,...,1,1,0,0,0,0,1,1,0,0
4,2,1,2,Female,1,Yes,No,3,Yes,No,...,1,1,0,0,1,0,0,0,0,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
7038,2,2,1,Female,0,No,No,13,Yes,No,...,0,0,0,1,1,0,0,0,0,1
7039,1,1,2,Male,0,Yes,No,22,Yes,Yes,...,1,1,0,0,1,0,0,1,0,0
7040,2,1,1,Male,0,No,No,2,Yes,No,...,0,1,0,0,0,0,1,1,0,0
7041,2,3,1,Male,0,Yes,Yes,67,Yes,No,...,0,0,0,1,1,0,0,0,0,1
7042,1,3,1,Male,0,Yes,Yes,63,No,No phone service,...,0,0,0,1,0,0,1,1,0,0

In [67]:
def prep_telco(df):
    useless_cols = ['Unnamed: 0', 'customer_id', 'internet_service_type', 'streaming_tv', 'streaming_movies',
                'contract_type', 'payment_type', 'paperless_billing', 'device_protection']
    df.drop(columns = useless_cols, inplace = True)
    
    dummies = pd.get_dummies(df[['gender', 'partner', 'dependents', 'phone_service', 'multiple_lines', 'churn',
                                  'online_security', 'online_backup', 'tech_support']])

    df = pd.concat([df, dummies], axis = 1)
    
    return df

In [68]:
test_telco = acquire.get_telco_data()
test_telco

,Unnamed: 0,payment_type_id,contract_type_id,internet_service_type_id,customer_id,gender,senior_citizen,partner,dependents,tenure,...,tech_support,streaming_tv,streaming_movies,paperless_billing,monthly_charges,total_charges,churn,internet_service_type,contract_type,payment_type
0,0,2,2,1,0002-ORFBO,Female,0,Yes,Yes,9,...,Yes,Yes,No,Yes,65.60,593.3,No,DSL,One year,Mailed check
1,1,2,1,1,0003-MKNFE,Male,0,No,No,9,...,No,No,Yes,No,59.90,542.4,No,DSL,Month-to-month,Mailed check
2,2,1,1,2,0004-TLHLJ,Male,0,No,No,4,...,No,No,No,Yes,73.90,280.85,Yes,Fiber optic,Month-to-month,Electronic check
3,3,1,1,2,0011-IGKFF,Male,1,Yes,No,13,...,No,Yes,Yes,Yes,98.00,1237.85,Yes,Fiber optic,Month-to-month,Electronic check
4,4,2,1,2,0013-EXCHZ,Female,1,Yes,No,3,...,Yes,Yes,No,Yes,83.90,267.4,Yes,Fiber optic,Month-to-month,Mailed check
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
7038,7038,2,2,1,9987-LUTYD,Female,0,No,No,13,...,Yes,No,No,No,55.15,742.9,No,DSL,One year,Mailed check
7039,7039,1,1,2,9992-RRAMN,Male,0,Yes,No,22,...,No,No,Yes,Yes,85.10,1873.7,Yes,Fiber optic,Month-to-month,Electronic check
7040,7040,2,1,1,9992-UJOEL,Male,0,No,No,2,...,No,No,No,Yes,50.30,92.75,No,DSL,Month-to-month,Mailed check
7041,7041,2,3,1,9993-LHIEB,Male,0,Yes,Yes,67,...,Yes,No,Yes,No,67.85,4627.65,No,DSL,Two year,Mailed check
7042,7042,1,3,1,9995-HOTOH,Male,0,Yes,Yes,63,...,No,Yes,Yes,No,59.00,3707.6,No,DSL,Two year,Electronic check

In [70]:
new_telco = prep_telco(test_telco)
new_telco

KeyError: "['Unnamed: 0', 'customer_id', 'internet_service_type', 'streaming_tv', 'streaming_movies', 'contract_type', 'payment_type', 'paperless_billing', 'device_protection'] not found in axis"

# SPLIT function

In [76]:
split_iris_df = acquire.get_iris_data()

In [77]:
clean_iris_df = prep_iris(split_iris_df)

In [80]:
tvt_iris_train, tvt_iris_val, tvt_iris_test = prepare.train_val_test(clean_iris_df, 'species')

In [81]:
tvt_iris_train.shape, tvt_iris_val.shape, tvt_iris_test.shape

((105, 8), (22, 8), (23, 8))

In [82]:
split_titanic_df = acquire.get_titanic_data()

In [83]:
clean_titanic_df = prep_titanic(split_titanic_df)

In [84]:
tvt_titanic_train, tvt_titanic_val, tvt_titanic_test = prepare.train_val_test(clean_titanic_df, 'survived')

In [85]:
tvt_titanic_train.shape, tvt_titanic_val.shape, tvt_titanic_test.shape

((623, 15), (134, 15), (134, 15))

In [86]:
split_telco_df = acquire.get_telco_data()

In [88]:
clean_telco_df = prep_telco(split_telco_df)

In [90]:
tvt_telco_train, tvt_telco_val, tvt_telco_test = prepare.train_val_test(clean_telco_df, 'churn')

In [91]:
tvt_telco_train.shape, tvt_telco_val.shape, tvt_telco_test.shape

((4930, 38), (1056, 38), (1057, 38))